from django.utils.translation import ugettext_lazy as _

STUDENTS_CLASSES = [('1', 'الأول'), ('2', 'الثاني'),
                    ('3', 'الثالث'), ('4', 'الرابع'),
                    ('5', 'الخامس'), ('6', 'السادس'),
                    ('7', 'السابع'), ('8', 'الثامن'),
                    ('9', 'التاسع')
                    ]

SEMESTERS = [
    ('1', _('First')),
    ('2', _('Second')),
    ('3', _('Third')),
]
SEMESTERS_DIC = {'1': {'ar': 'الأولى', 'en': 'First'},
                 '2': {'ar': 'الثانية', 'en': 'Second'},
                 '3': {'ar': 'الثالثة', 'en': 'Third'}
                 }

WEEK_DAYS = [('sunday', 'الأحد'), ('monday', 'الإثنين'),
             ('tuesday', 'الثلاثاء'), ('wednesday', 'الأربعاء'),
             ('thursday', 'الخميس')]

YEARS_ = [x for x in range(1995, 2025)]
MONTHS = {
    1: ('يناير'), 2: ('فبراير'), 3: (' مارس'), 4: ('أبريل'),
    5: ('مايو'), 6: ('يونيو'), 7: ('يوليو'), 8: ('أغسطس'),
    9: ('سبتمبر'), 10: ('أكتوبر'), 11: ('نوفمبر'), 12: ('ديسمبر')
}

# TYPE = [('1', 'نصفي'), ('2', 'نهائي'), ('3', 'دور ثاني'),
#         ('4', 'دور ثالث')]
TYPE = [('1', _('Midterm')), ('2', _('Final')),
        ('3', _('Second Round')), ('4', _('Third Round'))]

# TYPE_DIC = {'1': 'نصفي', '2': 'نهائي', '3': 'دور ثاني',
#             '4': 'دور ثالث'}
TYPE_DIC = {'1': {'ar': 'نصفي', 'en': 'Midterm'},
            '2': {'ar': 'نهائي', 'en': 'Final'},
            '3': {'ar': 'دور ثاني', 'en': 'Second Round'},
            '4': {'ar': 'دور ثالث', 'en': 'Third Round'}}

YEARS = [(str(x), str(x)) for x in range(2000, 2035)]
