STUDENTS_CLASSES = [('1', 'الأول'), ('2', 'الثاني'),
                    ('3', 'الثالث'), ('4', 'الرابع'),
                    ('5', 'الخامس'), ('6', 'السادس'),
                    ('7', 'السابع'), ('8', 'الثامن'),
                    ('9', 'التاسع')
                    ]

SEMESTERS = [
    ('1', 'الأولى'), ('2', 'الثانية'),
    ('3', 'الثالثة')
]
SEMESTERS_DIC = {'1': 'الأولى',
                 '2': 'الثانية',
                 '3': 'الثالثة'}
WEEK_DAYS = [('sunday', 'الأحد'), ('monday', 'الإثنين'),
             ('tuesday', 'الثلاثاء'), ('wednesday', 'الأربعاء'),
             ('thursday', 'الخميس')]

YEARS_ = [x for x in range(1995, 2025)]
MONTHS = {
    1: ('يناير'), 2: ('فبراير'), 3: (' مارس'), 4: ('أبريل'),
    5: ('مايو'), 6: ('يونيو'), 7: ('يوليو'), 8: ('أغسطس'),
    9: ('سبتمبر'), 10: ('أكتوبر'), 11: ('نوفمبر'), 12: ('ديسمبر')
}

TYPE = [('1', 'نصفي'), ('2', 'نهائي'), ('3', 'دور ثاني'),
        ('4', 'دور ثالث')]

TYPE_DIC = {'1': 'نصفي', '2': 'نهائي', '3': 'دور ثاني',
            '4': 'دور ثالث'}


YEARS = [(str(x), str(x)) for x in range(2000, 2035)]
