









# NATIONALITY = [('ليبي', 'ليبي'), ('مصري', 'مصري'),
#                ('مغربي', 'مغربي'), ('جزائري', 'جزائري'),
#                ('صومالي', 'صومالي'), ('تونسي', 'تونسي'),
#                ('سوري', 'سوري'), ('سوداني', 'سوداني'),
#                ('عراقي', 'عراقي'), ('قطري', 'قطري'),
#                ('أردني', 'أردني'), ('فلسطيني', 'فلسطيني'),
#                ('إماراتي', 'إماراتي'), ('سعودي', 'سعودي'),
#                ('تركي', 'تركي'), ('نيجيري', 'نيجيري'),
#                ('لبناني', 'لبناني'), ('موريتاني', 'موريتاني')
#                ]

