SEMESTER = [('2', 'الثانية'),
            ('3', 'الثالثة')]

PART = [('2', 'الثاني'),
        ('3', 'الثالث')]

STUDENTS_CLASSES = [('1', 'الأول'), ('2', 'الثاني'),
                    ('3', 'الثالث'), ('4', 'الرابع'),
                    ('5', 'الخامس'), ('6', 'السادس'),
                    ('7', 'السابع'), ('8', 'الثامن'),
                    ('9', 'التاسع')
                    ]


GENDER = [('ml', 'ذكر'), ('fl', 'أنثى')]

NATIONALITY = [('ليبي', 'ليبي'), ('مصري', 'مصري'),
               ('مغربي', 'مغربي'), ('جزائري', 'جزائري'),
               ('صومالي', 'صومالي'), ('تونسي', 'تونسي'),
               ('سوري', 'سوري'), ('سوداني', 'سوداني'),
               ('عراقي', 'عراقي'), ('قطري', 'قطري'),
               ('أردني', 'أردني'), ('فلسطيني', 'فلسطيني'),
               ('إماراتي', 'إماراتي'), ('سعودي', 'سعودي'),
               ('تركي', 'تركي'), ('نيجيري', 'نيجيري'),
               ('لبناني', 'لبناني')]


ENTRY = [('نظامي', 'نظامي'), ('منتسب', 'منتسب')]
STATUS = [('مستجد', 'مستجد'), ('معيد', 'معيد')]

ORDER = [('1', 'الأول'), ('2', 'الثاني'), ('3', 'الثالث')]


YEARS = [x for x in range(1995, 2025)]
MONTHS = {
    1: ('يناير'), 2: ('فبراير'), 3: (' مارس'), 4: ('أبريل'),
    5: ('مايو'), 6: ('يونيو'), 7: ('يوليو'), 8: ('أغسطس'),
    9: ('سبتمبر'), 10: ('أكتوبر'), 11: ('نوفمبر'), 12: ('ديسمبر')
}
